{
"puns":
	["Light travels faster than sound. That's why some people appear bright until you hear them speak",
	"When life gives you melons, you're dyslexic",
	"Apple is designing a new automatic car. But they’re having trouble installing Windows!",
	"Don't go bacon my heart. I couldn't if I fried.",
	"Did you hear about the guy who turned into a vampire before he was bitten? Yeah, Premature edraculation is rough.",
	"If you see an Apple Store get robbed, does that make you an iWitness?",
	"What kind of concert only costs 45 cents? A 50 Cent concert featuring Nickelback.",
	"Did you hear about the World War I soldier who survived both pepper spray and mustard gas? He was a seasoned veteran.",
	"Why do Buddhist monks avoid sending word documents? They’re supposed to avoid attachments.",
	"Why do teenage girls travel in odd numbered groups? Because they just can’t even.",
	"This girl said she recognized me from the vegetarian club, but I’d never met herbivore.",
	"I’m reading a book about anti-gravity. I just can’t put it down.",
	"I stayed up all night to see where the sun went. Then it dawned on me.",
	"Broken pencils are pointless.",
	"Have you ever had sex while camping? It’s f***ing in tents!",
	"What did the grape say when it got crushed? Nothing, it just let out a little wine.",
	"I had a crazy dream last night! I was swimming in an ocean of orange soda. Turns out it was just a Fanta sea.",
	"A crazy wife says to her husband that moose are falling from the sky. The husband says, it’s reindeer.",
	"All chemists know that alcohol is always a solution",
	"What do you get when you mix alcohol and literature? Tequila mockingbird",
	"I've got the body of a 16 year old. And if the cops ever find out she's in my basement...I'm in biiiigggg trouble",
	"When the past, present, and future go camping they always argue. It's intense tense in tents",
	"How does an attorney sleep? First he lies on one side, then he lies on the other",
	"What was Forrest Gump’s email password? 1forrest1",
	"Let me tell you about my grandfather. He was a good man, a brave man. He had the heart of a lion, and a lifetime ban from the zoo",
	"Can February March? No, but April May.",
	"Yesterday, I accidentally swallowed some food coloring. The doctor says I’m okay, but I feel like I’ve dyed a little inside.",
	"My friend drove his expensive car into a tree and found out how his Mercedes bends.",
	"Ladies, if he can’t appreciate your fruit jokes, you need to let that mango.",
	"I made a pun about the wind but it blows.",
	"What’s the difference between a poorly dressed man on a bicycle and a nicely dressed man on a tricycle? A tire.",
	"What do you call an alligator in a vest? An investigator.",
	"What do you call a man with no arms and no legs stuffed in your mailbox? Bill.",
	"What did the sushi say to the bee? Wasabee!",
	"Did you hear about the guy who got hit in the head with a can of soda? He was lucky it was a soft drink!",
	"The past, the present, and the future walk into a bar. It was tense!",
	"My dad unfortunately passed away when we couldn’t remember his blood type. His last words to us were, “Be positive!”",
	"Trying to get online at my mother-in-law’s, I scrolled through various Internet access names. One neighbor’s Wi-Fi really stood out: “You Kids Get Off My LAN!”",
	"Don't interrupt someone working intently on a puzzle. Chances are, you'll hear some crosswords.",
	"Why was King Arthur's army too tired to fight? It had too many sleepless knights.",
	"I was going to make myself a belt made out of watches, but then I realized it would be a waist of time.",
	"If you were a fruit, you'd be a fine-apple",
	"How can you spot a nosy pepper? It gets Jalapeño business!",
	"What did one eye say to the other? Just between you and me, something smells.",
	"A photon checks into a hotel. The front desk asks if it has any luggage. It replies “no, I’m traveling light”",
	"Did you hear about the glass blower who accidentally inhaled? He got stomach pane.",
	"Why did the hipster burn his mouth on pizza? Because he ate it before it was cool.",
	"Don’t ever believe an atom, they make up everything.",
	"Why does Waldo (from Where’s Waldo) always wear a striped shirt? He doesn’t want to be spotted.",
	"I dropped my toothpaste, I’m crestfallen.",
	"I went to a zoo the other day, but there was only one dog there. It was a Shitzu.",
	"A Roman walks into a bar and says “I’ll have a martinus.” The bartender says “you mean a martini?” The Roman replies “no, if I wanted a double I would have asked for one.”",
	"I did a theatrical performance about puns. It was really just a play on words.",
	"Why did the can crusher quit her job? It was soda-pressing.",
	"Why do people love switzerland? Well, the flag is a big plus. Unlike Canada’s, which I could take or leaf.",
	"Why do defense lawyers go out for Mexican food when they’re feeling down? To get some case-ideas!",
	"Did you hear that the Devil is going bald? Yeah, there’s gonna be hell toupee.",
	"Why is Peter Pan always flying? He Neverlands.",
	"I went to a dog show the other day. A Yorkie took Best in Show, a Jack Russell took second, and a Scotty took third. I’m starting to think the judges had some sort of All-Terrier motive.",
	"What do you call a dinosaur with an extensive vocabulary? A thesaurus.",
	"I don’t enjoy computer jokes. Not one bit.",
	"I changed my phone’s name to Titanic. It’s syncing now.",
	"What do you do when you find Niacin and Thiamin at your front door? You vitamin, of course!",
	"A termite walks into the bar. He sits down and asks “hey, is the bartender?”",
	"A Mexican magician told his audience he would disappear on the count of three. He wrapped his cape around himself and counted. “Uno… Dos…” and then disappeared without a Tres.",
	"A Steak Pun is a Rare Medium Well Done",
	"What did the elephant ask the naked man? “How do you breathe out of that thing?”",
	"Why does the mermaid wear seashells? She outgrew her b-shells!",
	"How is life like toilet paper? You’re either on a roll or taking shit from someone.",
	"What does one boob say to the other boob? If we don’t get support, people will think we’re nuts.",
	"Did you hear about the exorcist who offers a payment plan? Apparently if people fall behind on payments, they’ll get repossessed!",
	"Why don’t chemists like puns? All the best ones argon.",
	"It's hard to explain puns to kleptomaniacs because they always take things literally",
	"What are the strongest days of the week? Saturday and Sunday, the rest are weekdays",
	"Biologists have recently produced immortal frogs by removing their vocal cords. They can't croak.",
	"The best way to communicate with a fish is to drop them a line.",
	"On the surface of things, whales are always blowing it.",
	"The marine biology seminars weren't created for entertainment, but for educational porpoises.",
	"The fish are getting annoying with their octopus neighbor. He tentacles late at night.",
	"The tuna married the swordfish because he was such a catch.",
	"Marine mammals are simply otter this world.",
	"Crustaceans only think of themselves. They're so shellfish.",
	"This reef is the strongest part of the ocean because it has so many mussels.",
	"I can't tell if this fish is lying; she's being so koi.",
	"You ain’t got muffin on me.",
	"Just dill with it!",
	"He’s nacho poppa!",
	"Let’s taco ‘bout it!",
	"Do you want to ketchup?",
	"I donut know how I would live without you.",
	"I bet the butcher the other day that he couldn't reach the meat that was on the top shelf. He refused, saying that the steaks were too high.",
	"We love high-quality produce that's not too thick, so we won't settle for meaty-okra vegetables.",
	"Why was the clumsy farmer a great DJ? Because he was always dropping beets.",
	"The mushroom is always the hit of the party — he's a real fungi.",
	"I love you a latte.",
	"I want to espresso my love.",
	"Where you have bean all my life?",
	"What did the coffee tell his date? You're brew-tiful.",
	"Coffee beans have successful marriages because they keep each other grounded.",
	"You mocha me crazy.",
	"Hipsters always burn their tongues because they drink their coffee before it's cool.",
	"Coffee beans are always late; they're chronic pro-caffeinators.",
	"Why did the tea break up with her older coffee boyfriend? He was so cold and bitter.",
	"I wanted to order a new drink, but affogato what it's called.",
	"What did the muscle say to the blood vessel? \"You’re being a little vein.\"",
	"What did the phlebotomist say to cheer up the patient? “B positive.”",
	"What did the leg say to the foot? “It’s going tibia k!”",
	"I was worried about my transplant surgery, but the surgeon really de-livered.",
	"What happens when you have a bladder infection? Urine trouble.",
	"Why can’t you lie to the x-ray tech? They can see right through you.",
	"I used to disapprove of organ transplants, but now I've had a change of heart.",
	"Why are legs hereditary? Because they run in your jeans.",
	"Why did the appendix get dressed up? Because she heard the doctor was taking her out tonight.",
	"Don't annoy a pediatrician. They have little patients.",
	"Why did the ketchup blush? He saw the salad dressing.",
	"What is six inches long, two inches wide, and makes everyone go crazy? A $100 bill.",
	"How do you spot a blind man on a nude beach? It’s not hard.",
	"I'm afraid for the calendar. Its days are numbered.",
	"My wife said I should do lunges to stay in shape. That would be a big step forward.",
	"Why do fathers take an extra pair of socks when they go golfing? In case they get a hole in one!",
	"Singing in the shower is fun until you get soap in your mouth. Then it's a soap opera.",
	"What do a tick and the Eiffel Tower have in common? They're both Paris sites.",
	"What do you call a fish wearing a bowtie? Sofishticated.",
	"How do you follow Will Smith in the snow? You follow the fresh prints.",
	"If April showers bring May flowers, what do May flowers bring? Pilgrims.",
	"I thought the dryer was shrinking my clothes. Turns out it was the refrigerator all along.",
	"What do you call a factory that makes okay products? A satisfactory.",
	"Dear Math, grow up and solve your own problems.",
	"What did the janitor say when he jumped out of the closet? Supplies!",
	"Have you heard about the chocolate record player? It sounds pretty sweet.",
	"What did the ocean say to the beach? Nothing, it just waved.",
	"Why do seagulls fly over the ocean? Because if they flew over the bay, we'd call them bagels.",
	"I only know 25 letters of the alphabet. I don't know y.",
	"How does the moon cut his hair? Eclipse it.",
	"What did one wall say to the other? I'll meet you at the corner.",
	"What did the zero say to the eight? That belt looks good on you.",
	"A skeleton walks into a bar and says, 'Hey, bartender. I'll have one beer and a mop.'",
	"Where do fruits go on vacation? Pear-is!",
	"I asked my dog what's two minus two. He said nothing.",
	"What did Baby Corn say to Mama Corn? Where's Pop Corn?",
	"What's the best thing about Switzerland? I don't know, but the flag is a big plus.",
	"What does a sprinter eat before a race? Nothing, they fast!",
	"Where do you learn to make a banana split? Sundae school.",
	"What has more letters than the alphabet? The post office!",
	"Dad, did you get a haircut? No, I got them all cut!",
	"What do you call a poor Santa Claus? St. Nickel-less.",
	"I got carded at a liquor store, and my Blockbuster card accidentally fell out. The cashier said never mind.",
	"Where do boats go when they're sick? To the boat doc.",
	"I don't trust those trees. They seem kind of shady.",
	"My wife is really mad at the fact that I have no sense of direction. So I packed up my stuff and right!",
	"How do you get a squirrel to like you? Act like a nut.",
	"Why don't eggs tell jokes? They'd crack each other up.",
	"I don't trust stairs. They're always up to something.",
	"What do you call someone with no body and no nose? Nobody knows.",
	"Did you hear the rumor about butter? Well, I'm not going to spread it!",
	"Why couldn't the bicycle stand up by itself? It was two tired.",
	"What did one hat say to the other? Stay here! I'm going on ahead.",
	"Why did Billy get fired from the banana factory? He kept throwing away the bent ones."]
}